In [204]:
import pandas as pd
import numpy as np
import altair as alt
import datetime as dt 
import matplotlib.pyplot as plt

In [205]:
df = pd.read_csv('data.csv' , encoding="ISO-8859-1")
df.columns = df.columns.str.lower()
df.head(10)

,invoiceno,stockcode,description,quantity,invoicedate,unitprice,customerid,country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
5,536365,22752,SET 7 BABUSHKA NESTING BOXES,2,12/1/2010 8:26,7.65,17850.0,United Kingdom
6,536365,21730,GLASS STAR FROSTED T-LIGHT HOLDER,6,12/1/2010 8:26,4.25,17850.0,United Kingdom
7,536366,22633,HAND WARMER UNION JACK,6,12/1/2010 8:28,1.85,17850.0,United Kingdom
8,536366,22632,HAND WARMER RED POLKA DOT,6,12/1/2010 8:28,1.85,17850.0,United Kingdom
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,12/1/2010 8:34,1.69,13047.0,United Kingdom

In [295]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 539394 entries, 0 to 541908
Data columns (total 14 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    539394 non-null  object
 1   stockcode    539394 non-null  object
 2   description  539394 non-null  object
 3   quantity     539394 non-null  int64
 4   invoicedate  539394 non-null  datetime64[ns]
 5   unitprice    539394 non-null  float64
 6   customerid   406789 non-null  object
 7   country      539394 non-null  object
 8   year         539394 non-null  object
 9   month        539394 non-null  object
 10  day          539394 non-null  object
 11  time         539394 non-null  datetime64[ns]
 12  weekday      539394 non-null  object
 13  total_price  539394 non-null  float64
dtypes: datetime64[ns](2), float64(2), int64(1), object(9)
memory usage: 81.7+ MB

In [207]:
df.invoicedate = pd.to_datetime(df.invoicedate) #convert to datetime

In [208]:
print(df.isnull().any())
print('--------------------')
print('QTY of N/A')
print(df.isnull().sum() / 541909 * 100)

invoiceno      False
stockcode      False
description     True
quantity       False
invoicedate    False
unitprice      False
customerid      True
country        False
dtype: bool
--------------------
QTY of N/A
invoiceno       0.000000
stockcode       0.000000
description     0.268311
quantity        0.000000
invoicedate     0.000000
unitprice       0.000000
customerid     24.926694
country         0.000000
dtype: float64

In [209]:
def covertnan(x) :
    if x == 'nan':
        return np.nan
    else:
        return x

df['customerid']= df['customerid'].apply(covertnan) #แก้ไขnanให้pyเข้าใจ

In [210]:
def convert_float_str(x):
    if np.isnan(x) :
        return x
    else :
        x = float(x)
        x = int(x)
        x = str(x)
        return x

df['customerid'] = df['customerid'].apply(convert_float_str)

In [211]:
df.describe()

            quantity      unitprice
count  541909.000000  541909.000000
mean        9.552250       4.611114
std       218.081158      96.759853
min    -80995.000000  -11062.060000
25%         1.000000       1.250000
50%         3.000000       2.080000
75%        10.000000       4.130000
max     80995.000000   38970.000000

In [212]:
def covertminus(x):
    if x < 0 :
        return x*-1
    else :
        return x
df['quantity'] = df['quantity'].apply(covertminus)
df['unitprice'] = df['unitprice'].apply(covertminus)
df.describe()

            quantity      unitprice
count  541909.000000  541909.000000
mean       11.340487       4.692766
std       217.995482      96.755927
min         1.000000       0.000000
25%         1.000000       1.250000
50%         3.000000       2.080000
75%        10.000000       4.130000
max     80995.000000   38970.000000

In [213]:
df.loc[df['unitprice'] == 0 ,'unitprice'] = np.nan
df.dropna(subset = ['description' , 'unitprice'] , inplace=True)

In [214]:
df['year'] = df['invoicedate'].dt.year.astype(str)
df['month'] = df['invoicedate'].dt.month.astype(str)
df['day'] = pd.DatetimeIndex(df['invoicedate']).date
df['time'] = df['invoicedate'].dt.time
df['time'] = pd.to_datetime(df['time'] , format= '%H:%M:%S')
df['weekday'] = df['invoicedate'].dt.day_name()
df['total_price'] = df['unitprice'] * df['quantity']

In [215]:
df

,invoiceno,stockcode,description,quantity,invoicedate,unitprice,customerid,country,year,month,day,time,weekday,total_price
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,2010,12,2010-12-01,1900-01-01 08:26:00,Wednesday,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2010,12,2010-12-01,1900-01-01 08:26:00,Wednesday,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,2010,12,2010-12-01,1900-01-01 08:26:00,Wednesday,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2010,12,2010-12-01,1900-01-01 08:26:00,Wednesday,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2010,12,2010-12-01,1900-01-01 08:26:00,Wednesday,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680,France,2011,12,2011-12-09,1900-01-01 12:50:00,Friday,10.20
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680,France,2011,12,2011-12-09,1900-01-01 12:50:00,Friday,12.60
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680,France,2011,12,2011-12-09,1900-01-01 12:50:00,Friday,16.60
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680,France,2011,12,2011-12-09,1900-01-01 12:50:00,Friday,16.60
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680,France,2011,12,2011-12-09,1900-01-01 12:50:00,Friday,14.85

In [216]:
df_c = df.groupby(['country'] , as_index=False)['total_price'].sum()
alt.Chart(df_c).mark_bar().encode(
    x = 'country:O' ,
    y = 'total_price:Q'
)

alt.Chart(...)

## Select United Kingdom

In [217]:
df_e = df[df['country'] == 'United Kingdom']
df_e.isnull().sum()/df_e['description'].count()*100

invoiceno       0.000000
stockcode       0.000000
description     0.000000
quantity        0.000000
invoicedate     0.000000
unitprice       0.000000
customerid     26.598794
country         0.000000
year            0.000000
month           0.000000
day             0.000000
time            0.000000
weekday         0.000000
total_price     0.000000
dtype: float64

In [218]:
df_e.drop_duplicates(subset=['invoiceno', 'customerid'], keep="first", inplace=True)
df_e

,invoiceno,stockcode,description,quantity,invoicedate,unitprice,customerid,country,year,month,day,time,weekday,total_price
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,2010,12,2010-12-01,1900-01-01 08:26:00,Wednesday,15.30
7,536366,22633,HAND WARMER UNION JACK,6,2010-12-01 08:28:00,1.85,17850,United Kingdom,2010,12,2010-12-01,1900-01-01 08:28:00,Wednesday,11.10
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,2010-12-01 08:34:00,1.69,13047,United Kingdom,2010,12,2010-12-01,1900-01-01 08:34:00,Wednesday,54.08
21,536368,22960,JAM MAKING SET WITH JARS,6,2010-12-01 08:34:00,4.25,13047,United Kingdom,2010,12,2010-12-01,1900-01-01 08:34:00,Wednesday,25.50
25,536369,21756,BATH BUILDING BLOCK WORD,3,2010-12-01 08:35:00,5.95,13047,United Kingdom,2010,12,2010-12-01,1900-01-01 08:35:00,Wednesday,17.85
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
541863,581582,23552,BICYCLE PUNCTURE REPAIR KIT,6,2011-12-09 12:21:00,2.08,17581,United Kingdom,2011,12,2011-12-09,1900-01-01 12:21:00,Friday,12.48
541865,581583,20725,LUNCH BAG RED RETROSPOT,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,2011,12,2011-12-09,1900-01-01 12:23:00,Friday,58.00
541867,581584,20832,RED FLOCK LOVE HEART PHOTO FRAME,72,2011-12-09 12:25:00,0.72,13777,United Kingdom,2011,12,2011-12-09,1900-01-01 12:25:00,Friday,51.84
541869,581585,22481,BLACK TEA TOWEL CLASSIC DESIGN,12,2011-12-09 12:31:00,0.39,15804,United Kingdom,2011,12,2011-12-09,1900-01-01 12:31:00,Friday,4.68
541890,581586,22061,LARGE CAKE STAND HANGING STRAWBERY,8,2011-12-09 12:49:00,2.95,13113,United Kingdom,2011,12,2011-12-09,1900-01-01 12:49:00,Friday,23.60

# RFM Segmentation

In [219]:
# RECENCY
print(df['day'].max())
now = dt.date(2012,1,1)
print(now)

def recency(x) :
    date = now - x
    return date.days

2011-12-09
2012-01-01

In [220]:
df_x = df_e.groupby(['customerid'] , as_index=False).agg({'invoiceno' : 'count','day' : 'max' , 'total_price' : 'sum'})
df_x.rename(columns={'invoiceno' : 'frequency' , 'total_price' : 'monetary_value'}, inplace=True)
df_x['recency'] = df_x['day'].apply(recency)
df_x.drop(columns = {'day'} , inplace = True)
df_x

     customerid  frequency  monetary_value  recency
0         12346          2       154367.20      348
1         12747         11          689.49       25
2         12748        223         7055.46       23
3         12749          8          134.45       26
4         12820          4           58.20       26
...         ...        ...             ...      ...
3944      18280          1           23.70      300
3945      18281          1            5.04      203
3946      18282          3           39.70       30
3947      18283         16           66.75       26
3948      18287          3           80.40       65

[3949 rows x 4 columns]

In [221]:
quantiles = df_x.quantile(q=[0.25,0.50,0.75])
quantiles

      frequency  monetary_value  recency
0.25        1.0           18.77     39.0
0.50        3.0           50.70     73.0
0.75        5.0          141.90    166.0

In [222]:
quantiles = dict(quantiles)
quantiles

{'frequency': 0.25    1.0
 0.50    3.0
 0.75    5.0
 Name: frequency, dtype: float64,
 'monetary_value': 0.25     18.77
 0.50     50.70
 0.75    141.90
 Name: monetary_value, dtype: float64,
 'recency': 0.25     39.0
 0.50     73.0
 0.75    166.0
 Name: recency, dtype: float64}

In [223]:
quantiles['frequency'][0.25]

1.0

In [224]:
def rscore(x,p):
    if x <= quantiles[p][0.25]:
        return str(4)
    elif x <= quantiles[p][0.5]:
        return str(3)
    elif x <= quantiles[p][0.75]:
        return str(2)    
    else :
        return str(1)

def mfscore(x,p):
    if x <= quantiles[p][0.25]:
        return str(1)
    elif x <= quantiles[p][0.5]:
        return str(2)
    elif x <= quantiles[p][0.75]:
        return str(3)
    else :
        return str(4)

In [225]:
df_x['r_quantile']= df_x['recency'].apply(rscore , args = ('recency',))
df_x['f_quantile']= df_x['frequency'].apply(mfscore , args = ('frequency',))
df_x['m_quantile']= df_x['monetary_value'].apply(mfscore , args = ('monetary_value',))
df_x

,customerid,frequency,monetary_value,recency,r_quantile,f_quantile,m_quantile
0,12346,2,154367.20,348,1,2,4
1,12747,11,689.49,25,4,4,4
2,12748,223,7055.46,23,4,4,4
3,12749,8,134.45,26,4,4,3
4,12820,4,58.20,26,4,3,3
...,...,...,...,...,...,...,...
3944,18280,1,23.70,300,1,1,2
3945,18281,1,5.04,203,1,1,1
3946,18282,3,39.70,30,4,2,2
3947,18283,16,66.75,26,4,4,3
3948,18287,3,80.40,65,3,2,3

In [226]:
df_x['total_score'] = df_x['r_quantile'] + df_x['f_quantile'] + df_x['m_quantile']
df_score = df_x[['customerid' , 'r_quantile' , 'f_quantile' , 'm_quantile' ,'total_score']]
df_score['r_quantile'] = df_score['r_quantile'].astype(int)
df_score['f_quantile'] = df_score['f_quantile'].astype(int)
df_score['m_quantile'] = df_score['m_quantile'].astype(int)
df_score['score'] = df_score['r_quantile'] + df_score['f_quantile'] + df_score['m_quantile']
df_score

     customerid  r_quantile  f_quantile  m_quantile total_score  score
0         12346           1           2           4         124      7
1         12747           4           4           4         444     12
2         12748           4           4           4         444     12
3         12749           4           4           3         443     11
4         12820           4           3           3         433     10
...         ...         ...         ...         ...         ...    ...
3944      18280           1           1           2         112      4
3945      18281           1           1           1         111      3
3946      18282           4           2           2         422      8
3947      18283           4           4           3         443     11
3948      18287           3           2           3         323      8

[3949 rows x 6 columns]

In [227]:
# score
# 444 = 12
# 333 = 9
# 222 = 6
# 111 = 3

def segmentation(x) :
    if x > 9 :
        return 'Class A'
    elif x > 6 :
        return 'Class B'
    elif x > 3 :
        return 'Class C'
    else :
        return 'Class F'

df_score['Class'] = df_score['score'].apply(segmentation)
df_score

,customerid,r_quantile,f_quantile,m_quantile,total_score,score,Class
0,12346,1,2,4,124,7,Class B
1,12747,4,4,4,444,12,Class A
2,12748,4,4,4,444,12,Class A
3,12749,4,4,3,443,11,Class A
4,12820,4,3,3,433,10,Class A
...,...,...,...,...,...,...,...
3944,18280,1,1,2,112,4,Class C
3945,18281,1,1,1,111,3,Class F
3946,18282,4,2,2,422,8,Class B
3947,18283,4,4,3,443,11,Class A
3948,18287,3,2,3,323,8,Class B

In [247]:
df_seg = df_score.groupby(['Class'],as_index=False)['customerid'].count()
alt.Chart(df_seg).mark_bar().encode(
    x = 'Class:O',
    y = 'customerid:Q',
    color = 'Class'
).properties(
    width = 200 ,
    height = 200 
)

alt.Chart(...)